straight_pipe/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{    
    inlet
    {       
		type            flowRateInletVelocity;
        massFlowRate    2000.0;     // Volumetric/mass flow rate [m3/s or kg/s]
		rho rho;
		rhoInlet 1.0;
    }
    outlet
    {
        type            zeroGradient;       
    }	
	wall
	{
		type 			fixedValue;
		value			uniform (10 10 10);
	}  
}


// ************************************************************************* //
